ERP.belugaerp/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>АлкогольнаяПродукция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>бг_АнализыДляУдостоверенияОКачестве</name>
    <type>
      <types>CatalogRef.бг_ТиповыеАнализыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Вариативность</name>
    <type>
      <types>CatalogRef.бг_ВариативностьНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ВидОперацииНалогообложенияАкцизом</name>
    <type>
      <types>CatalogRef.бг_ВидыОперацийНалогообложенияАкцизом</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Влажность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_Выбыл</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ГодУрожая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_Добавлен</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ЕК_СУМ</name>
    <type>
      <types>CatalogRef.бг_ЕК_СУМ</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_КодНоменклатурыSAP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_КонтрагентПроизводитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_НормативныйДокумент</name>
    <type>
      <types>CatalogRef.бг_НормативныеДокументыСертификацииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОбменB2B</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОписаниеСоставаПродукта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОсновноеНаименование</name>
    <type>
      <types>CatalogRef.бг_ОсновныеНаименованияНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОсновнойПоставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Предшественник</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Проверен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СрокГодности</name>
    <type>
      <types>CatalogRef.бг_ЕК_Номенклатура_СрокГодности</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СрокХраненияПробВЛабораторииМесяцев</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_Статус</name>
    <type>
      <types>EnumRef.бг_СтатусыНСИ</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СтатьяКалькуляции</name>
    <type>
      <types>CatalogRef.СтатьиКалькуляции</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СтранаПроизводителя</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТемператураДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТемператураОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТемператураХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТипИмпортныхССП</name>
    <type>
      <types>EnumRef.бг_ТипыИмпортныхССП</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ТипМарки</name>
    <type>
      <types>CatalogRef.бг_КлассификаторТиповМарок</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_УсловияТранспортирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_УчетОстатковИРезервовВРазрезеУпаковокПаллет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ФайлПиктограммы</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЗнаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВесИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВестиУчетПоГТД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВесЧислитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВидАлкогольнойПродукции</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаАналитическогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДлинаЗнаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДлинаИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДлинаЧислитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияСрокаГодности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИмпортнаяАлкогольнаяПродукция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьУпаковки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КодТНВЭД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Крепость</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НаборУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОбъемДАЛ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>18</precision>
          <scale>6</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОбъемЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъемЗнаменатель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОбъемИспользовать</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъемЧислитель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПроизводительИмпортерКонтрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СрокГодности</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТоварнаяКатегория</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЦеноваяГруппа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>бг_СпособыОбеспеченияПотребности</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособОбеспеченияПотребностей</name>
      <type>
        <types>CatalogRef.СпособыОбеспеченияПотребностей</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP.belugaerp/src/InformationRegisters/бг_ХарактеристикиУпаковокПаллет/бг_ХарактеристикиУпаковокПаллет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_ХарактеристикиУпаковокПаллет</name>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УпаковкаПаллета</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/Enums/бг_СтатусыНСИ/бг_СтатусыНСИ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_СтатусыНСИ</name>
  <enumValues>
    <name>Проект</name>
  </enumValues>
  <enumValues>
    <name>ЗапрещенКОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Catalogs/Номенклатура/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&Перед("ПередЗаписью")
Процедура бг_ПередЗаписьюПеред(Отказ)
	
	Если ОбменДанными.Загрузка 
		Или ЭтоГруппа 
		Или Отказ Тогда
		Возврат;
	КонецЕсли;
	
	бг_ЗаполнитьНаименованиеИзЧастей();
	ПредставлениеТемпературыХранения = 
		Справочники.Номенклатура.бг_ПредставлениеТемпературыХранения(бг_ТемператураОт, бг_ТемператураДо, бг_Влажность);
	Если ЗначениеЗаполнено(ПредставлениеТемпературыХранения) Тогда
		бг_ТемператураХранения = ПредставлениеТемпературыХранения;
	КонецЕсли;
КонецПроцедуры

&После("ПередЗаписью")
Процедура бг_ПередЗаписьюПосле(Отказ)
	
	Если ОбменДанными.Загрузка 
		Или ЭтоГруппа 
		Или Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		бг_Добавлен = ТекущаяДатаСеанса();
	КонецЕсли;
	
	бг_ОчиститьНеиспользуемыеРеквизиты();
	бг_СброситьПроверенность();
	бг_ОбновитьТоварныеКатегории();
	бг_ОбработатьПолноеНаименование();
	бг_ОпределитьНеобходимостьВыгружатьСвязанныеУпаковки();
	
    бг_СинхронизироватьНоменклатуруКонтрагентовПоКодуSAPПередЗаписью();

	бг_УстановитьПризнакУчетаОстатковИРезервовВРазрезеУпаковокПаллет();

КонецПроцедуры

&После("ПриЗаписи")
Процедура бг_ПриЗаписи(Отказ)   
	
	Если ОбменДанными.Загрузка 
		Или ЭтоГруппа 
		Или Отказ Тогда
		Возврат;
	КонецЕсли;     
	
	бг_Номенклатура.ЗаполнитьСпособыОбеспечения(Ссылка);  
	
	Если Не ЭтоНовый() Тогда
		РегистрыСведений.бг_ХарактеристикиУпаковокПаллет.СинхронизироватьХарактеристикиУпаковокПаллет(ЭтотОбъект);
	КонецЕсли;

	бг_СинхронизироватьНоменклатуруКонтрагентовПоКодуSAPПриЗаписи();

КонецПроцедуры

&После("ОбработкаПроверкиЗаполнения")
Процедура бг_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(ВидНоменклатуры)
		И ВидНоменклатуры = бг_КонстантыПовтИсп.ЗначениеКонстанты("ИмпортныеССП") Тогда
		
		ПроверяемыеРеквизиты.Добавить("бг_ТипИмпортныхССП");
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВидНоменклатуры)
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидНоменклатуры, "бг_ОграничиватьДобавлениеИзменениеНоменклатуры") = Истина Тогда
		ПроверяемыеРеквизиты.Добавить("бг_ОсновноеНаименование");
	КонецЕсли;
	
КонецПроцедуры

&Перед("ПриКопировании")
Процедура бг_ПриКопировании(ОбъектКопирования)
	
	бг_Статус = Перечисления.бг_СтатусыНСИ.ЗапрещенКОтгрузке;
	бг_Предшественник = ОбъектКопирования.Ссылка;
	бг_Проверен = Ложь;
	бг_Добавлен = '00010101';
	бг_Выбыл = '00010101';
	бг_КодНоменклатурыSAP = "";

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура бг_ОчиститьНеиспользуемыеРеквизиты()
	
	Производитель = Справочники.Производители.ПустаяСсылка();
	Марка = Справочники.Марки.ПустаяСсылка();
	
КонецПроцедуры

Процедура бг_СброситьПроверенность()
	
	Если Пользователи.РолиДоступны("бг_ДобавлениеИзменениеНоменклатурыАдминистратор, бг_ДобавлениеИзменениеНоменклатурыОтветственныйПользователь") Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидНоменклатуры, "бг_ОграничиватьДобавлениеИзменениеНоменклатуры") <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		бг_Проверен = Ложь;
		Возврат;
	КонецЕсли;
	
	Реквизиты = бг_ПроверяемыеРеквизиты();
	ЗначенияРеквизитовСсылки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты);
	
	Для Каждого Реквизит Из Реквизиты Цикл
		
		Если ЭтотОбъект[Реквизит] <> ЗначенияРеквизитовСсылки[Реквизит] Тогда
			бг_Проверен = Ложь;
			Возврат;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура бг_ЗаполнитьНаименованиеИзЧастей()
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		ВидНоменклатуры,
		"бг_ОграничиватьДобавлениеИзменениеНоменклатуры") = Истина Тогда
		Наименование = Справочники.Номенклатура.бг_НаименованиеИзЧастей(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

Процедура бг_ОбновитьТоварныеКатегории()
	
	ОбновитьТоварнуюКатегорию = Ложь;
	ОбновитьТоварнуюКатегориюСсылки = Ложь;
	
	Если ЗначениеЗаполнено(ТоварнаяКатегория) Тогда
		
		Если ЭтоНовый() Тогда
			ОбновитьТоварнуюКатегорию = Истина;
		Иначе
			
			РеквизитыСсылки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ТоварнаяКатегория, Крепость");
			ТоварнаяКатегорияСсылки = РеквизитыСсылки.ТоварнаяКатегория;
			
			Если ТоварнаяКатегория = ТоварнаяКатегорияСсылки Тогда
				
				Если Крепость <> РеквизитыСсылки.Крепость Тогда
					ОбновитьТоварнуюКатегорию = Истина;
				КонецЕсли;
				
			Иначе
				ОбновитьТоварнуюКатегорию = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЭтоНовый() Тогда
		
		ТоварнаяКатегорияСсылки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ТоварнаяКатегория");
		
		Если ЗначениеЗаполнено(ТоварнаяКатегорияСсылки)
			И ТоварнаяКатегорияСсылки <> ТоварнаяКатегория Тогда
			ОбновитьТоварнуюКатегориюСсылки = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбновитьТоварнуюКатегорию Тогда
		бг_ОбновитьТоварнуюКатегорию(ТоварнаяКатегория, Истина);
	КонецЕсли;
	
	Если ОбновитьТоварнуюКатегориюСсылки Тогда
		бг_ОбновитьТоварнуюКатегорию(ТоварнаяКатегорияСсылки, Ложь);
	КонецЕсли;
	
КонецПроцедуры

Процедура бг_ОбработатьПолноеНаименование()
	
	НаименованиеПолное = СтрЗаменить(НаименованиеПолное, "¶", "");	
	
КонецПроцедуры

Процедура бг_ОбновитьТоварнуюКатегорию(ТоварнаяКатегорияДляОбновления, ВключаяДанныеТекущегоОбъекта)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	МИНИМУМ(Номенклатура.Крепость / 100) КАК КрепостьМинимум,
	|	МАКСИМУМ(Номенклатура.Крепость / 100) КАК КрепостьМаксимум
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ТоварнаяКатегория = &ТоварнаяКатегория
	|	И Номенклатура.Ссылка <> &Ссылка";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ТоварнаяКатегория", ТоварнаяКатегорияДляОбновления);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		КрепостьМинимум = Выборка.КрепостьМинимум;
		КрепостьМаксимум = Выборка.КрепостьМаксимум;
	Иначе
		КрепостьМинимум = 0;
		КрепостьМаксимум = 0;
	КонецЕсли;
	
	Если ВключаяДанныеТекущегоОбъекта Тогда   
		Если ЗначениеЗаполнено(КрепостьМинимум) И ЗначениеЗаполнено(КрепостьМаксимум) Тогда
			КрепостьМинимум = Мин(КрепостьМинимум, Крепость / 100);
			КрепостьМаксимум = Макс(КрепостьМаксимум, Крепость / 100); 
		Иначе
			КрепостьМинимум = Крепость / 100;
			КрепостьМаксимум = Крепость / 100;
		КонецЕсли;
	КонецЕсли;
	
	РеквизитыТоварнойКатегории = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТоварнаяКатегорияДляОбновления, "бг_ДоляСпирта, бг_ДоляСпиртаДо");
	
	Если РеквизитыТоварнойКатегории.бг_ДоляСпирта <> КрепостьМинимум
		Или РеквизитыТоварнойКатегории.бг_ДоляСпиртаДо <> КрепостьМаксимум Тогда
		ТоварнаяКатегорияДляОбновленияОбъект = ТоварнаяКатегорияДляОбновления.ПолучитьОбъект();
		ТоварнаяКатегорияДляОбновленияОбъект.бг_ДоляСпирта = КрепостьМинимум;
		ТоварнаяКатегорияДляОбновленияОбъект.бг_ДоляСпиртаДо = КрепостьМаксимум;
		ТоварнаяКатегорияДляОбновленияОбъект.ДополнительныеСвойства.Вставить("НеОбновлятьДолиСпирта", Истина);
		ТоварнаяКатегорияДляОбновленияОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры

Функция бг_ПроверяемыеРеквизиты()
	
	Реквизиты = Новый Массив;
	
	Реквизиты.Добавить("Артикул");
	Реквизиты.Добавить("Наименование");
	Реквизиты.Добавить("НаименованиеПолное");
	Реквизиты.Добавить("бг_ОсновноеНаименование");
	Реквизиты.Добавить("бг_Вариативность");
	Реквизиты.Добавить("бг_КонтрагентПроизводитель");
	Реквизиты.Добавить("ПроизводительИмпортерКонтрагент");
	Реквизиты.Добавить("бг_Статус");
	Реквизиты.Добавить("бг_Добавлен");
	Реквизиты.Добавить("бг_Выбыл");
	Реквизиты.Добавить("бг_ГодУрожая");
	Реквизиты.Добавить("бг_ТемператураХранения");
	Реквизиты.Добавить("бг_ОбменB2B");
	Реквизиты.Добавить("бг_Проверен");
	Реквизиты.Добавить("ТоварнаяКатегория");
	Реквизиты.Добавить("ВидНоменклатуры");
	Реквизиты.Добавить("СтавкаНДС");
	Реквизиты.Добавить("ИспользоватьУпаковки");
	Реквизиты.Добавить("ЕдиницаИзмерения");
	Реквизиты.Добавить("ЕдиницаДляОтчетов");
	Реквизиты.Добавить("ВесЕдиницаИзмерения");
	Реквизиты.Добавить("ОбъемЕдиницаИзмерения");
	Реквизиты.Добавить("ДлинаЕдиницаИзмерения");
	Реквизиты.Добавить("ВидАлкогольнойПродукции");
	Реквизиты.Добавить("ИмпортнаяАлкогольнаяПродукция");
	Реквизиты.Добавить("ОбъемДАЛ");
	Реквизиты.Добавить("Крепость");
	
	Возврат Реквизиты;
	
КонецФункции

Процедура бг_ОпределитьНеобходимостьВыгружатьСвязанныеУпаковки()
	
	НеобходимоВыгружатьСвязанныеУпаковки = Ложь;
	
	Если ЗначениеЗаполнено(Ссылка) Тогда

		РеквизитыНоменклатурыВыгружаемыеСУпаковками = бг_НоменклатураИнтеграция.РеквизитыНоменклатурыВыгружаемыеСУпаковками();
		
		СтарыеЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			Ссылка,
			Новый ФиксированныйМассив(РеквизитыНоменклатурыВыгружаемыеСУпаковками));
			
		Для каждого ИмяРеквизита Из РеквизитыНоменклатурыВыгружаемыеСУпаковками Цикл
			Если СтарыеЗначенияРеквизитов[ИмяРеквизита] <> ЭтотОбъект[ИмяРеквизита] Тогда
				НеобходимоВыгружатьСвязанныеУпаковки = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("бг_НеобходимоВыгружатьСвязанныеУпаковки", НеобходимоВыгружатьСвязанныеУпаковки);

КонецПроцедуры

Процедура бг_СинхронизироватьНоменклатуруКонтрагентовПоКодуSAPПередЗаписью()

	Если ЭтоНовый() Тогда
		СтарыйКодНоменклатурыSAP = "";			
	Иначе	
		СтарыйКодНоменклатурыSAP = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "бг_КодНоменклатурыSAP");	
		Если Не ЗначениеЗаполнено(СтарыйКодНоменклатурыSAP) Тогда
			СтарыйКодНоменклатурыSAP = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ТоварнаяКатегория.бг_СкюМТ.КодНоменклатурыSAP");
		КонецЕсли;	
		Если Не ЗначениеЗаполнено(СтарыйКодНоменклатурыSAP) Тогда
			СтарыйКодНоменклатурыSAP = "";
		КонецЕсли;
	КонецЕсли;	
	ДополнительныеСвойства.Вставить("СтарыйКодНоменклатурыSAP", СтарыйКодНоменклатурыSAP);

КонецПроцедуры

Процедура бг_СинхронизироватьНоменклатуруКонтрагентовПоКодуSAPПриЗаписи()
	
	НовыйКодНоменклатурыSAP = бг_КодНоменклатурыSAP;	
	Если Не ЗначениеЗаполнено(НовыйКодНоменклатурыSAP) 
		И ЗначениеЗаполнено(ТоварнаяКатегория) Тогда
		НовыйКодНоменклатурыSAP = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТоварнаяКатегория, "бг_СкюМТ.КодНоменклатурыSAP");	
	КонецЕсли;
	Если Не ЗначениеЗаполнено(НовыйКодНоменклатурыSAP) Тогда
		НовыйКодНоменклатурыSAP = "";
	КонецЕсли;
	
	Если ДополнительныеСвойства.СтарыйКодНоменклатурыSAP <> НовыйКодНоменклатурыSAP Тогда
		бг_НоменклатураКонтрагентов.СинхронизироватьНоменклатуруКонтрагентовПоКодуSAP(Ссылка);	
	КонецЕсли;
	
КонецПроцедуры

Процедура бг_УстановитьПризнакУчетаОстатковИРезервовВРазрезеУпаковокПаллет()

	// Флаг должен браться строго из вида номенклатуры.
	УчетВРазрезеПаллетДляВидаНоменклатуры = Ложь;
	Если ЗначениеЗаполнено(ВидНоменклатуры) Тогда
		УстановитьПривилегированныйРежим(Истина);
		УчетВРазрезеПаллетДляВидаНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
					ВидНоменклатуры,
					"бг_УчетОстатковИРезервовВРазрезеУпаковокПаллет"); 
	    УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	бг_УчетОстатковИРезервовВРазрезеУпаковокПаллет = УчетВРазрезеПаллетДляВидаНоменклатуры;	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
